package org.example.org.example.lessons.lesson09.lesson
//
//В Kotlin массивы и списки используются для хранения наборов данных. Эти структуры данных имеют как сходства, так и отличия, и выбор между ними зависит от конкретных требований вашей программы.
//
//Массивы (Arrays)
//Массивы в Kotlin - это упорядоченные коллекции фиксированного размера, содержащие элементы одного типа.
//
//Создание Массива:
//
//Используя arrayOf:
//
//val numbers = arrayOf(1, 2, 3, 4, 5)
//Специализированные Функции:
//
//val doubles = doubleArrayOf(1.1, 2.2, 3.3)
//Создание Пустого Массива:
//
//val emptyArray = Array(5) { "" }
//val emptyNullableArray = arrayOfNulls<Int>(5)
//
//Массивы в Kotlin изменяемы: вы можете изменить значение элемента, обратившись к нему по индексу.
//
//Когда использовать массив
//Фиксированный размер: Массивы (Array) имеют фиксированный размер, который определяется при их создании и не может быть изменен. Это полезно, когда вы точно знаете количество элементов и оно не изменится.
//
//Примитивные типы данных: Если вам нужно работать с примитивными типами данных (например, Int, Double, Float), то массивы могут быть более эффективными с точки зрения производительности благодаря специализированным версиям, таким как IntArray, DoubleArray.
//
//Производительность: Массивы могут быть немного более эффективными в плане производительности из-за меньшего количества оберток и прямого доступа к памяти.
//
//Списки (Lists)
//Списки в Kotlin более универсальны, они могут быть изменяемыми (MutableList) и неизменяемыми (List).
//
//Создание Списка:
//
//Неизменяемый Список:
//
//val readOnlyList: List<String> = listOf("a", "b", "c")
//Изменяемый Список:
//
//val mutableList: MutableList<String> = mutableListOf("a", "b", "c")
//Неизменяемые Списки:
//
//Неизменяемые списки (List) гарантируют, что их содержимое не изменится после создания. Это полезно для:
//
//Безопасности потоков: Неизменяемые коллекции безопасны для использования в многопоточных средах, так как они не изменяются.
//
//Предотвращения сторонних изменений: Когда вы передаете список в функцию, вы можете быть уверены, что он не будет изменен.
//
//Оптимизации памяти: Неизменяемые списки могут быть более эффективными в использовании памяти, так как компилятор может оптимизировать хранение и обработку.
//
//Изменение данных в списках и массивах
//Массивы: Вы можете изменить элемент, обратившись к нему по индексу:
//
//numbers[0] = 10
//Изменяемые списки: Можно добавлять, удалять и изменять элементы:
//
//mutableList.add("d")
//mutableList.removeAt(0)
//mutableList[0] = "e"
//Когда использовать списки
//Гибкость размера: Списки (List и MutableList) являются более гибкими, так как их размер может изменяться динамически. Это удобно, если количество элементов в коллекции может изменяться в процессе выполнения программы.
//
//Удобство использования: Работа со списками часто бывает более удобной и интуитивно понятной, особенно при выполнении таких операций, как добавление, удаление и фильтрация элементов.
//
//Множества (Sets)
//Множества (Set) в Kotlin - это коллекции, которые хранят уникальные элементы. Они могут быть как изменяемыми (MutableSet), так и неизменяемыми (Set). Множества полезны, когда важно гарантировать уникальность элементов или когда порядок элементов не имеет значения.
//
//Неизменяемое множество (Set):
//
//val numbersSet: Set<Int> = setOf(1, 2, 3, 4, 5)
//Изменяемое множество (MutableSet):
//
//val mutableNumbersSet: MutableSet<Int> = mutableSetOf(1, 2, 3, 4, 5)
//Вы также можете создать пустое множество:
//
//val emptySet: Set<Int> = emptySet()
//val emptyMutableSet: MutableSet<Int> = mutableSetOf()
//Операции с Множествами
//Вы можете добавлять и удалять элементы в изменяемых множествах (MutableSet):
//
//mutableNumbersSet.add(6)   // Добавляет элемент
//mutableNumbersSet.remove(1) // Удаляет элемент
//Отличия от List
//В Set каждый элемент может появиться только один раз. List допускает повторение элементов.
//
//Когда использовать Set
//Удаление дубликатов: Чтобы автоматически удалять дублирующиеся элементы из коллекции.
//
//Проверка принадлежности: Быстро проверять, содержится ли элемент в коллекции, так как множества оптимизированы для операций поиска.
//
//Математические операции: Выполнение математических операций над коллекциями, таких как объединение, пересечение и разность множеств.
//
//Польза использования Set
//Использование Set в Kotlin полезно, когда вам нужна коллекция с уникальными элементами и вы часто выполняете операции проверки наличия элементов. Множества обеспечивают более высокую производительность для таких операций по сравнению со списками, особенно когда размер коллекции велик.
//
//Перебор данных в списках
//val set = setOf("K", "o", "t", "l", "i", "n")
//for (letter in set) {
//    println("| $letter |")
//}
//val list = listOf(32, 53,1, -76)
//for (index in list.indices) {
//    if (index == list.lastIndex) {
//        println(list[index] + list[0])
//    } else {
//        println(list[index] + list[index + 1])
//    }
//}
//var index = list.lastIndex
//while (index >= 0) {
//    println("`${list[index--]}`")
//}
//
//
//Практические задания
//Работа с массивами Array
//Создайте пустой массив целых чисел (тип Int) длиной 10 заполненного нулями.
//Создайте массив с типом Double, содержащий пять элементов, и инициализируйте его значениями от 1.0 до 5.0.
//Создайте массив из 10 элементов типа Int и используйте цикл for для заполнения массива числами от 10 до 100 с шагом 10.
//Создайте массив из 5 строк (String) и заполните его любыми значениями. Затем используйте цикл для замены всех элементов на пустую строку.
//Создайте массив из 5 элементов типа String? (nullable String) и инициализируйте его значениями, где некоторые элементы - null.
//Создайте массив целых чисел и скопируйте его в новый массив с использованием цикла.
//Создайте два массива целых чисел одинаковой длины и используйте цикл для создания третьего массива, каждый элемент которого является суммой соответствующих элементов исходных массивов.
//Создайте массив целых чисел и найдите индекс элемента со значением 5. Если элемент не найден, выведите соответствующее сообщение.
//Создайте массив строк и используйте цикл для поиска определенного значения. Выведите индекс найденного элемента.
//Создайте массив целых чисел и переверните его, используя цикл (последний элемент становится первым и так далее).
//Работа со списками List
//Создайте пустой неизменяемый список целых чисел.
//Создайте список строк, содержащий пять элементов с любыми значениями.
//Создайте пустой изменяемый список с элементами типа Float.
//Добавьте в ранее созданный изменяемый список три числа типа Float.
//Удалите из списка элемент по индексу и элемент по значению.
//Создайте список целых чисел и используйте цикл for для вывода каждого элемента списка.
//Создайте список и получите доступ к его элементам по индексу, выведите их значения.
//Создайте изменяемый список и замените один из его элементов новым значением.
//Создайте список строк и используйте цикл для поиска определенной строки. Выведите true, если строка найдена.
//Создайте два списка целых чисел и объедините их в один список.
//Создайте список целых чисел и используйте цикл для создания нового списка, содержащего только четные числа из исходного списка.
//Работа с Множествами Set
//Создайте пустое неизменяемое множество целых чисел.
//Создайте неизменяемое множество целых чисел, содержащее числа от 1 до 5.
//Создайте изменяемое множество строк и инициализируйте его несколькими различными значениями.
//Имея изменяемое множество целых чисел, добавьте в него новые элементы (например, 6 и 7).
//Имея изменяемое множество строк, удалите из него определенный элемент (например, строку "Kotlin").
//Создайте множество целых чисел и используйте цикл для вывода каждого элемента на экран.
//Имея изменяемое множество целых чисел, попробуйте заменить один из элементов (обратите внимание на особенности множеств).
//Создайте два множества целых чисел и объедините их в одно новое множество, содержащее уникальные элементы обоих множеств.
//Создайте два множества целых чисел и найдите их пересечение (общие элементы).
//Создайте множество целых чисел и проверьте, содержится ли в нем число 5.
//