package org.example.org.example.lessons.lesson10.lesson
//
//Пары значений (Pair)
//В Kotlin часто используется удобная конструкция для создания пар ключ-значение при работе со словарями (Map). Эта конструкция представляет собой использование инфиксной функции to, которая создает пару из двух элементов.
//
//Что такое “to” в Kotlin?
//Ключевое слово to в Kotlin - это инфиксная функция, которая принимает два аргумента и создает из них Pair. Pair - это класс, представляющий собой кортеж из двух элементов. При использовании to, первый элемент считается ключом, а второй - значением.
//
//Пример создания пары:
//
//val pair = 1 to "a"
//В этом примере создается пара (Pair), где 1 - это первый элемент (ключ), а "a" - второй элемент (значение). Результатом является объект Pair<Int, String>.
//
//Подробности о Pair:
//Pair - это класс данных в Kotlin, который хранит два значения: первое (first) и второе (second).
//
//Эти значения могут быть разных типов.
//
//Пары часто используются в функциях, которые требуют возвращения двух значений.
//
//Словари (Map)
//Словари (или Map) в Kotlin - это коллекции, хранящие данные в виде пар "ключ-значение". Они предоставляют удобный способ организации данных, где каждому уникальному ключу соответствует значение. В Kotlin есть два основных типа словарей: изменяемые (MutableMap) и неизменяемые (Map).
//
//Неизменяемые словари (Map)
//Неизменяемый словарь Map - это коллекция, в которой после создания нельзя изменить содержимое.
//
//Создание неизменяемого словаря:
//
//Пустой словарь:
//
//val emptyMap = mapOf<String, String>()
//Словарь, проинициализированный значениями
//
//val capitals = mapOf("Россия" to "Москва", "Франция" to "Париж")
//val map = mapOf(1 to "a", 2 to "b", 3 to "c")
//Здесь каждая пара чисел и строк создается с помощью to и передается в функцию mapOf, которая создает неизменяемый словарь (Map). В этом словаре каждое целое число (1, 2, 3) является ключом, а каждая строка ("a", "b", "c") - соответствующим значением.
//
//Изменяемые словари (MutableMap)
//Изменяемый словарь MutableMap позволяет добавлять, удалять и изменять элементы после его создания.
//
//Создание изменяемого словаря:
//
//val mutableCapitals = mutableMapOf("Россия" to "Москва", "Франция" to "Париж")
//Добавление и удаление элементов:
//
//mutableCapitals["Германия"] = "Берлин"
//mutableCapitals.remove("Франция")
//Примеры работы со словарями
//Доступ к элементам:
//
//val capitalOfRussia = capitals["Россия"]
//Перебор элементов:
//
//for ((country, capital) in capitals) {
//    println("$country: $capital")
//}
//Условия:
//
//if ("Россия" in capitals) {
//    println("Столица России: ${capitals["Россия"]}")
//}
//Использование неизменяемых и изменяемых словарей
//Неизменяемые Словари: Используются для хранения данных, которые не должны изменяться после создания. Это обеспечивает безопасность данных и упрощает отладку программы.
//
//Изменяемые Словари: Подходят для ситуаций, когда необходимо динамически изменять данные, например, добавлять или удалять пары ключ-значение.
//
//Ключи в словарях
//Когда мы работаем со словарями (Map) в Kotlin, важно понимать роль ключей и значений, а также их особенности.
//
//Уникальность ключей
//Ключи в словаре должны быть уникальными. Это означает, что каждый ключ может появляться в словаре только один раз. Если вы попытаетесь добавить в словарь пару ключ-значение, где ключ уже существует, старое значение, ассоциированное с этим ключом, будет перезаписано новым. Это ключевая особенность словарей, которая позволяет эффективно управлять данными:
//
//val map = mutableMapOf("a" to 1, "b" to 2)
//map["a"] = 3  // значение по ключу "a" теперь будет 3, а не 1
//Ключи и Null
//В Kotlin ключи в словарях могут быть null, хотя это и не является обычной практикой. Использование null в качестве ключа следует рассматривать осторожно, так как это может привести к ошибкам в логике программы и затруднить отладку:
//
//val mapWithNullableKey = mutableMapOf<String?, Int>(null to 1)
//Неуникальность значений
//В отличие от ключей, значения в словаре могут быть неуникальными. Разные ключи могут быть связаны с одним и тем же значением:
//
//val map = mutableMapOf("a" to 1, "b" to 1, "c" to 2)
//В этом примере ключи "a" и "b" связаны с одним и тем же значением 1.
//
//Важность уникальности ключей
//Уникальность ключей является фундаментальным принципом словарей, поскольку она обеспечивает однозначное сопоставление каждого ключа с соответствующим значением. Если бы ключи не были уникальными, не было бы ясности относительно того, какое значение следует извлекать по данному ключу.
//
//
//Практические задания
//Создание словарей и работа с ними
//Создайте пустой неизменяемый словарь, где ключами будут строки, а значениями - целые числа.
//Создайте неизменяемый словарь, где ключами являются целые числа, а значениями - строки, и инициализируйте его несколькими парами.
//Создайте изменяемый словарь, где ключами и значениями являются строки, и инициализируйте его несколькими парами.
//Имея изменяемый словарь, добавьте в него новую пару ключ-значение.
//Имея изменяемый словарь, удалите из него элемент по определенному ключу.
//Создайте словарь и используйте цикл для вывода всех его ключей и соответствующих значений.
//Напишите функцию для печати значения по заданному ключу с использованием цикла. Если значения нет - печатать "значение не найдено".
//Имея изменяемый словарь, измените значение для одного из ключей.
//Создайте словарь, где ключами будут строки, а значениями - списки целых чисел. Инициализируйте его и добавьте в список новый элемент.
//Создайте два словаря и напишите код для их объединения в один словарь (учтите возможные одинаковые ключи).
//Создайте словарь, где ключами будут множества строк, а значениями - целые числа. Найдите значение по конкретному ключу-множеству.
//Создай словарь, где ключами будут множества. Через перебор найди ключ содержащий элемент множества
//Подбор оптимального типа для ключа и значения словаря
//График работы сотрудников: ключи - это дни недели, а значения - списки сотрудников, работающих в каждый день. График составляется на короткий период и не подразумевает изменения.
//Учебный план: ключи - это названия предметов, а значения - списки доступных курсов и их описаний.
//Инвентарь в игре: ключи - фиксированный список категорий предметов (оружие, броня, артефакты), а значения - множества доступных предметов в каждой категории.
//Расписание транспорта: ключи - это номера маршрутов, а значения - расписания отправлений от конечной. Список маршрутов и расписание движений каждый раз утверждается в минтрансе.
//Контакты в телефонной книге: ключи - это имена контактов, а значения - список данных контакта (например, номер телефона, адрес электронной почты).
//